#+startup: showall

** PROFESSIONAL CORE (PC)
{{{curriculum-table3}}}
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| No | Code    | Course                                             | Periods |  L | T |  P | E |    C |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  1 | UCS2302 | Data Structures                                    |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  2 | UCS2303 | Object Oriented Programming                        |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  3 | UCS2312 | Data Structures Lab                                |       4 |  0 | 0 |  4 | 0 |    2 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  4 | UCS2313 | Object Oriented Programming Lab                    |       3 |  0 | 0 |  3 | 0 |  1.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  5 | UCS2401 | Computer Organization and Architecture             |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  6 | UCS2402 | Operating Systems                                  |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  7 | UCS2403 | Design and Analysis of Algorithms (TCP)            |       5 |  3 | 0 |  2 | 0 |    4 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  8 | UCS2404 | Database Management Systems                        |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|  9 | UCS2412 | Operating Systems Lab                              |       3 |  0 | 0 |  3 | 0 |  1.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 10 | UCS2411 | Database Lab                                       |       3 |  0 | 0 |  3 | 0 |  1.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 11 | UCS2501 | Computer Networks                                  |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 12 | UCS2502 | Microprocessors, microcontrollers, and Interfacing |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 13 | UCS2504 | Foundations of Artificial Intelligence (TCP)       |       5 |  3 | 0 |  2 | 0 |    4 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 14 | UCS2503 | Software Engineering                               |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 15 | UCS2511 | Networks Lab                                       |       3 |  0 | 0 |  3 | 0 |  1.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 16 | UCS2512 | Microprocessors Lab                                |       3 |  0 | 0 |  3 | 0 |  1.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 17 | UCS2601 | Internet Programming                               |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 18 | UCS2602 | Software System Security                           |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 19 | UCS2604 | Principles of Machine Learning                     |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 20 | UCS2603 | Theory of Computation                              |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 21 | UCS2611 | Internet Programming Lab                           |       3 |  0 | 0 |  3 | 0 |  1.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 22 | UCS2612 | Machine Learning Lab                               |       3 |  0 | 0 |  3 | 0 |  1.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 23 | UCS2701 | Distributed Systems                                |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 24 | UCS2703 | Software Architecture                              |       3 |  3 | 0 |  0 | 0 |    3 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
| 25 | UCS2702 | Compiler Design (TCP)                              |       5 |  3 | 0 |  2 | 0 |    4 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
|    |         |                                                    |      82 | 51 | 0 | 31 | 0 | 66.5 |
|----+---------+----------------------------------------------------+---------+----+---+----+---+------|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N

** PROFESSIONAL ELECTIVES (PE)
{{{curriculum-table3}}}   
|----+------+---------------------------+---------+----+---+---+---+----|
| No | Code | Course                    | Periods |  L | T | P | E |  C |
|----+------+---------------------------+---------+----+---+---+---+----|
|  1 |      | Professional Elective I   |       3 |  3 | 0 | 0 |   |  3 |
|----+------+---------------------------+---------+----+---+---+---+----|
|  2 |      | Professional Elective II  |       3 |  3 | 0 | 0 |   |  3 |
|----+------+---------------------------+---------+----+---+---+---+----|
|  3 |      | Professional Elective III |       3 |  3 | 0 | 0 |   |  3 |
|----+------+---------------------------+---------+----+---+---+---+----|
|  4 |      | Professional Elective IV  |       3 |  3 | 0 | 0 |   |  3 |
|----+------+---------------------------+---------+----+---+---+---+----|
|  5 |      | Professional Elective V   |       3 |  3 | 0 | 0 |   |  3 |
|----+------+---------------------------+---------+----+---+---+---+----|
|  6 |      | Professional Elective VI  |       3 |  3 | 0 | 0 |   |  3 |
|----+------+---------------------------+---------+----+---+---+---+----|
|    |      |                           |      18 | 18 | 0 | 0 | 0 | 18 |
|----+------+---------------------------+---------+----+---+---+---+----|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N

** EMPLOYABILITY ENHANCEMENT COURSES (EEC)
{{{curriculum-table3}}}   
|----+---------+----------------------------------+---------+---+---+----+---+----|
| No | Code    | Course                           | Periods | L | T |  P | E |  C |
|----+---------+----------------------------------+---------+---+---+----+---+----|
|  1 | UCS2717 | Project Work Phase I             |       6 | 0 | 0 |  6 | 0 |  3 |
|----+---------+----------------------------------+---------+---+---+----+---+----|
|  2 | UCS2716 | Industrial Training / Internship |       0 | 0 | 0 |  0 | 0 |  2 |
|----+---------+----------------------------------+---------+---+---+----+---+----|
|  3 | UCS2818 | Project Work Phase II            |      16 | 0 | 0 | 16 | 0 |  8 |
|----+---------+----------------------------------+---------+---+---+----+---+----|
|    |         |                                  |      22 | 0 | 0 | 22 | 0 | 13 |
|----+---------+----------------------------------+---------+---+---+----+---+----|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N

